applications/test/multiWorld/chtMultiRegionSimpleFoam/fluid/0/topAir/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            calculated;
        value           uniform 100000;
    }
    left
    {
        type            calculated;
        value           uniform 100000;
    }
    right
    {
        type            calculated;
        value           uniform 100000;
    }
    bottom
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
